---
kind: method
id: M:Autodesk.Revit.DB.Element.GetEntitySchemaGuids
zh: 构件、图元、元素
source: html/742313cb-1bea-f873-e5ca-1bfac782286b.htm
---
# Autodesk.Revit.DB.Element.GetEntitySchemaGuids Method

**中文**: 构件、图元、元素

Returns the Schema guids of any Entities stored in this element.

## Syntax (C#)
```csharp
public IList<Guid> GetEntitySchemaGuids()
```

## Returns
The schema Entity guids.